; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-81)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 sat9 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 ins16 ins17 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 dir9 - direction
    )
 (:init 
    (pointing sat1 dir4)
    (pointing sat2 dir2)
    (pointing sat3 dir6)
    (pointing sat4 dir4)
    (pointing sat5 dir1)
    (pointing sat6 dir3)
    (pointing sat7 dir9)
    (pointing sat8 dir9)
    (pointing sat9 dir9)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (power_avail sat9)
    (calibration_target ins1 dir5)
    (calibration_target ins2 dir2)
    (calibration_target ins3 dir9)
    (calibration_target ins4 dir6)
    (calibration_target ins5 dir6)
    (calibration_target ins6 dir2)
    (calibration_target ins7 dir2)
    (calibration_target ins8 dir8)
    (calibration_target ins9 dir7)
    (calibration_target ins10 dir2)
    (calibration_target ins11 dir9)
    (calibration_target ins12 dir5)
    (calibration_target ins13 dir6)
    (calibration_target ins14 dir9)
    (calibration_target ins15 dir7)
    (calibration_target ins16 dir8)
    (calibration_target ins17 dir4)
    (on_board ins1 sat2)
    (on_board ins2 sat1)
    (on_board ins3 sat9)
    (on_board ins4 sat6)
    (on_board ins5 sat5)
    (on_board ins6 sat3)
    (on_board ins7 sat7)
    (on_board ins8 sat4)
    (on_board ins9 sat8)
    (on_board ins10 sat2)
    (on_board ins11 sat3)
    (on_board ins12 sat5)
    (on_board ins13 sat6)
    (on_board ins14 sat3)
    (on_board ins15 sat9)
    (on_board ins16 sat4)
    (on_board ins17 sat8)
    (supports ins8 mod2)
    (supports ins5 mod3)
    (supports ins16 mod2)
    (supports ins14 mod1)
    (supports ins7 mod3)
    (supports ins10 mod3)
    (supports ins17 mod1)
    (supports ins8 mod3)
    (supports ins16 mod1)
    (supports ins4 mod2)
    (supports ins11 mod3)
    (supports ins5 mod1)
    (supports ins13 mod3)
    (supports ins3 mod2)
    (supports ins11 mod2)
    (supports ins1 mod2)
    (supports ins6 mod2)
    (supports ins16 mod3)
    (supports ins1 mod1)
    (supports ins2 mod2)
    (supports ins1 mod3)
    (supports ins11 mod1)
    (supports ins14 mod3)
    (supports ins9 mod2)
    (supports ins15 mod2)
    (supports ins9 mod3)
    (supports ins4 mod3)
    (supports ins12 mod2))
 (:goal (and 
(have_image dir2 mod2)
(have_image dir7 mod2)
(have_image dir2 mod1)
))
)

; plan
1. (switch_on ins1 sat2)
   deleted: (power_avail sat2)
   added: (power_on ins1)
   goals met: 0 of 3
2. (turn_to sat2 dir5 dir2)
   deleted: (pointing sat2 dir2)
   added: (pointing sat2 dir5)
   goals met: 0 of 3
3. (calibrate sat2 ins1 dir5)
   added: (calibrated ins1)
   goals met: 0 of 3
4. (turn_to sat2 dir2 dir5)
   deleted: (pointing sat2 dir5)
   added: (pointing sat2 dir2)
   goals met: 0 of 3
5. (take_image sat2 dir2 ins1 mod1)
   added: (have_image dir2 mod1)
   goals met: 1 of 3
6. (take_image sat2 dir2 ins1 mod2)
   added: (have_image dir2 mod2)
   goals met: 2 of 3
7. (turn_to sat2 dir7 dir2)
   deleted: (pointing sat2 dir2)
   added: (pointing sat2 dir7)
   goals met: 2 of 3
8. (take_image sat2 dir7 ins1 mod2)
   added: (have_image dir7 mod2)
   goals met: 3 of 3
